{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Embedding", "config": {"trainable": false, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": true, "input_dim": 1297526, "batch_input_shape": [null, 100], "W_regularizer": null, "dropout": 0.0, "output_dim": 300, "input_length": 100}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": false, "input_dim": 300, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 64}}, "trainable": true, "name": "timedistributed_1"}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "forward_lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.5, "dropout_W": 0.5, "input_dim": 64, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 64, "forget_bias_init": "one", "input_length": null}}, "trainable": true, "name": "bidirectional_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}}]}